app/controllers/store_controller.rb

INSERT INTO `line_items` (`order_id`, `updated_at`, `total_price`, `product_id`, `quantity`, `created_at`) VALUES(1, '2009-05-17 14:45:44', 29.95, 1, 1, '2009-05-17 14:45:44')
INSERT INTO `orders` (`name`, `updated_at`, `pay_type`, `address`, `email`, `created_at`) VALUES('teset', '2009-05-17 14:45:44', 'check', 'test', 'asdf', '2009-05-17 14:45:44')
---
  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save