app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => :name)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `hashed_password`, `created_at`) VALUES('dave', '127321500.985767023939053', '2009-05-20 15:55:40', '5093cd53e4572a586ae3b0a650f50a986f441fa3', '2009-05-20 15:55:40')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `hashed_password` = '49f2896a5311f44e52a9bee5e19013ecdf5b1bf6', `salt` = '127907100.651515681067575', `updated_at` = '2009-05-20 15:57:08' WHERE `id` = 1